/* automatically generated by rust-bindgen */

pub const true_: u32 = 1;
pub const false_: u32 = 0;
pub const __bool_true_false_are_defined: u32 = 1;
pub const _STDINT_H: u32 = 1;
pub const _FEATURES_H: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const __USE_ISOC11: u32 = 1;
pub const __USE_ISOC99: u32 = 1;
pub const __USE_ISOC95: u32 = 1;
pub const __USE_POSIX_IMPLICITLY: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 200809;
pub const __USE_POSIX: u32 = 1;
pub const __USE_POSIX2: u32 = 1;
pub const __USE_POSIX199309: u32 = 1;
pub const __USE_POSIX199506: u32 = 1;
pub const __USE_XOPEN2K: u32 = 1;
pub const __USE_XOPEN2K8: u32 = 1;
pub const _ATFILE_SOURCE: u32 = 1;
pub const __USE_MISC: u32 = 1;
pub const __USE_ATFILE: u32 = 1;
pub const __USE_FORTIFY_LEVEL: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_GETS: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_SCANF: u32 = 0;
pub const _STDC_PREDEF_H: u32 = 1;
pub const __STDC_IEC_559__: u32 = 1;
pub const __STDC_IEC_559_COMPLEX__: u32 = 1;
pub const __STDC_ISO_10646__: u32 = 201706;
pub const __GNU_LIBRARY__: u32 = 6;
pub const __GLIBC__: u32 = 2;
pub const __GLIBC_MINOR__: u32 = 29;
pub const _SYS_CDEFS_H: u32 = 1;
pub const __glibc_c99_flexarr_available: u32 = 1;
pub const __WORDSIZE: u32 = 64;
pub const __WORDSIZE_TIME64_COMPAT32: u32 = 1;
pub const __SYSCALL_WORDSIZE: u32 = 64;
pub const __HAVE_GENERIC_SELECTION: u32 = 1;
pub const __GLIBC_USE_LIB_EXT2: u32 = 0;

pub const UINTPTR_MAX: i32 = -1;
pub const PTRDIFF_MIN: i64 = -9223372036854775808;
pub const PTRDIFF_MAX: u64 = 9223372036854775807;
pub const SIG_ATOMIC_MIN: i32 = -2147483648;
pub const SIG_ATOMIC_MAX: u32 = 2147483647;
pub const SIZE_MAX: i32 = -1;
pub const WINT_MIN: u32 = 0;
pub const WINT_MAX: u32 = 4294967295;
pub const NEWRELIC_DATASTORE_FIREBIRD: &'static [u8; 9usize] = b"Firebird\0";
pub const NEWRELIC_DATASTORE_INFORMIX: &'static [u8; 9usize] = b"Informix\0";
pub const NEWRELIC_DATASTORE_MSSQL: &'static [u8; 6usize] = b"MSSQL\0";
pub const NEWRELIC_DATASTORE_MYSQL: &'static [u8; 6usize] = b"MySQL\0";
pub const NEWRELIC_DATASTORE_ORACLE: &'static [u8; 7usize] = b"Oracle\0";
pub const NEWRELIC_DATASTORE_POSTGRES: &'static [u8; 9usize] = b"Postgres\0";
pub const NEWRELIC_DATASTORE_SQLITE: &'static [u8; 7usize] = b"SQLite\0";
pub const NEWRELIC_DATASTORE_SYBASE: &'static [u8; 7usize] = b"Sybase\0";
pub const NEWRELIC_DATASTORE_MEMCACHE: &'static [u8; 10usize] = b"Memcached\0";
pub const NEWRELIC_DATASTORE_MONGODB: &'static [u8; 8usize] = b"MongoDB\0";
pub const NEWRELIC_DATASTORE_ODBC: &'static [u8; 5usize] = b"ODBC\0";
pub const NEWRELIC_DATASTORE_REDIS: &'static [u8; 6usize] = b"Redis\0";
pub const NEWRELIC_DATASTORE_OTHER: &'static [u8; 6usize] = b"Other\0";
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    assert_eq!(
        ::std::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__fsid_t>())).__val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__fsid_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _nr_app_and_info_t {
    _unused: [u8; 0],
}
#[doc = " @brief A New Relic application.  Once an application configuration is"]
#[doc = " created with newrelic_create_app_config(), call newrelic_create_app()"]
#[doc = " to create an application to report data to the daemon; the daemon,"]
#[doc = " in turn, reports data to New Relic."]
#[doc = ""]
#[doc = " @see newrelic_create_app()."]
pub type newrelic_app_t = _nr_app_and_info_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _newrelic_txn_t {
    _unused: [u8; 0],
}
#[doc = " @brief A New Relic transaction. A transaction is started using"]
#[doc = " newrelic_start_web_transaction() or"]
#[doc = " newrelic_start_non_web_transaction(). A started, or active, transaction is"]
#[doc = " stopped using newrelic_end_transaction(). One may modify a transaction"]
#[doc = " by adding custom attributes or recording errors only after it has been"]
#[doc = " started."]
pub type newrelic_txn_t = _newrelic_txn_t;
#[doc = " @brief A time, measured in microseconds.  C SDK configuration and API"]
#[doc = " calls with time-related parameters expect this type.  For an example"]
#[doc = " configuration, see newrelic_transaction_tracer_config_t."]
pub type newrelic_time_us_t = u64;
#[doc = " The highest-priority loglevel; only errors are logged."]
pub const _newrelic_loglevel_t_NEWRELIC_LOG_ERROR: _newrelic_loglevel_t = 0;
#[doc = " The loglevel for warnings and errors."]
pub const _newrelic_loglevel_t_NEWRELIC_LOG_WARNING: _newrelic_loglevel_t = 1;
#[doc = " The loglevel for informational logs, warnings, and errors."]
pub const _newrelic_loglevel_t_NEWRELIC_LOG_INFO: _newrelic_loglevel_t = 2;
#[doc = " The highest-verbosity loglevel."]
pub const _newrelic_loglevel_t_NEWRELIC_LOG_DEBUG: _newrelic_loglevel_t = 3;
#[doc = " @brief Log levels.  An enumeration of the possible log levels for an SDK"]
#[doc = " configuration, or newrelic_app_config_t.  The highest priority loglevel"]
#[doc = " is NEWRELIC_LOG_ERROR.  The level NEWRELIC_LOG_DEBUG offers the greatest"]
#[doc = " verbosity."]
#[doc = ""]
#[doc = " @see newrelic_app_config_t"]
pub type _newrelic_loglevel_t = u32;
pub use self::_newrelic_loglevel_t as newrelic_loglevel_t;
#[doc = " When the record_sql field of the newrelic_transaction_tracer_config_t"]
#[doc = "  is set to NEWRELIC_SQL_OFF, no queries are reported to New Relic."]
pub const _newrelic_tt_recordsql_t_NEWRELIC_SQL_OFF: _newrelic_tt_recordsql_t = 0;
#[doc = " For the SQL-like datastores which are supported by the C SDK, when the"]
#[doc = "  record_sql field of the newrelic_transaction_tracer_config_t is set"]
#[doc = "  to NEWRELIC_SQL_RAW the query param of the"]
#[doc = "  newrelic_datastore_segment_config_t is reported as-is to New Relic."]
#[doc = ""]
#[doc = "  @warning This setting is not recommended."]
pub const _newrelic_tt_recordsql_t_NEWRELIC_SQL_RAW: _newrelic_tt_recordsql_t = 1;
#[doc = " For the SQL-like datastores which are supported by the C SDK, when the"]
#[doc = "  record_sql field of the newrelic_transaction_tracer_config_t is set"]
#[doc = "  to NEWRELIC_SQL_RAW the query param of the"]
#[doc = "  newrelic_datastore_segment_config_t is reported to New Relic with"]
#[doc = "  alphanumeric characters set to \'?\'"]
pub const _newrelic_tt_recordsql_t_NEWRELIC_SQL_OBFUSCATED: _newrelic_tt_recordsql_t = 2;
#[doc = " @brief Configuration values used to configure how SQL queries"]
#[doc = " are recorded and reported to New Relic."]
#[doc = ""]
#[doc = " @see newrelic_transaction_tracer_config_t"]
pub type _newrelic_tt_recordsql_t = u32;
pub use self::_newrelic_tt_recordsql_t as newrelic_tt_recordsql_t;
#[doc = " Use 4*apdex(T) as the minimum time a transaction must take before it is"]
#[doc = "  eligible for a transaction trace."]
pub const _newrelic_transaction_tracer_threshold_t_NEWRELIC_THRESHOLD_IS_APDEX_FAILING:
    _newrelic_transaction_tracer_threshold_t = 0;
#[doc = " Use the value given in the duration_us field as the minimum time a"]
#[doc = "  transaction must take before it is eligible for a transaction trace."]
pub const _newrelic_transaction_tracer_threshold_t_NEWRELIC_THRESHOLD_IS_OVER_DURATION:
    _newrelic_transaction_tracer_threshold_t = 1;
#[doc = " @brief Configuration values used to configure the behaviour of the"]
#[doc = " transaction tracer."]
#[doc = ""]
#[doc = "  @see newrelic_transaction_tracer_config_t"]
pub type _newrelic_transaction_tracer_threshold_t = u32;
pub use self::_newrelic_transaction_tracer_threshold_t as newrelic_transaction_tracer_threshold_t;
#[doc = " @brief Configuration used to configure transaction tracing."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _newrelic_transaction_tracer_config_t {
    #[doc = "  @brief Whether to enable transaction traces."]
    #[doc = ""]
    #[doc = "  Default: true."]
    pub enabled: bool,
    #[doc = "  @brief Whether to consider transactions for trace generation based on the apdex"]
    #[doc = "  configuration or a specific duration."]
    #[doc = ""]
    #[doc = "  Default: NEWRELIC_THRESHOLD_IS_APDEX_FAILING."]
    pub threshold: newrelic_transaction_tracer_threshold_t,
    #[doc = "  @brief If the SDK configuration threshold is set to"]
    #[doc = "  NEWRELIC_THRESHOLD_IS_OVER_DURATION, this field specifies the minimum"]
    #[doc = "  transaction time before a trace may be generated, in microseconds."]
    #[doc = ""]
    #[doc = "  Default: 0."]
    pub duration_us: newrelic_time_us_t,
    #[doc = "  @brief Sets the threshold above which the New Relic SDK will record a"]
    #[doc = "  stack trace for a transaction trace, in microseconds."]
    #[doc = ""]
    #[doc = "  Default: 500000, or 0.5 seconds."]
    pub stack_trace_threshold_us: newrelic_time_us_t,
    pub datastore_reporting: _newrelic_transaction_tracer_config_t__bindgen_ty_1,
}
#[doc = "  @brief The datastore_reporting field of newrelic_transaction_tracer_config_t"]
#[doc = "  is a collection of configuration values that control how certain"]
#[doc = "  characteristics of datastore queries are recorded."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _newrelic_transaction_tracer_config_t__bindgen_ty_1 {
    #[doc = "  @brief Controls whether slow datastore queries are recorded."]
    #[doc = ""]
    #[doc = "  If set to true for a transaction, the transaction tracer records"]
    #[doc = "  the top-10 slowest queries along with a stack trace of where the"]
    #[doc = "  call occurred."]
    #[doc = ""]
    #[doc = "  Default: true."]
    pub enabled: bool,
    #[doc = "  @brief Controls the format of the sql put into transaction traces for"]
    #[doc = "  supported sql-like products."]
    #[doc = ""]
    #[doc = "  Only relevant if the datastore_reporting.enabled field is set to true."]
    #[doc = ""]
    #[doc = "  - If set to NEWRELIC_SQL_OFF, transaction traces have no sql in them."]
    #[doc = "  - If set to NEWRELIC_SQL_RAW, the sql is added to the transaction"]
    #[doc = "    trace as-is."]
    #[doc = "  - If set to NEWRELIC_SQL_OBFUSCATED, alphanumeric characters are set"]
    #[doc = "    to \'?\'. For example \'SELECT * FROM table WHERE foo = 42\' is reported"]
    #[doc = "    as \'SELECT * FROM table WHERE foo = ?\'.  These obfuscated queries are"]
    #[doc = "    added to the transaction trace for supported datastore products."]
    #[doc = ""]
    #[doc = "  @warning New Relic highly discourages the use of the NEWRELIC_SQL_RAW setting"]
    #[doc = "  in production environments."]
    #[doc = ""]
    #[doc = "  Default: NEWRELIC_SQL_OBFUSCATED."]
    pub record_sql: newrelic_tt_recordsql_t,
    #[doc = "  @brief Specify the threshold above which a datastore query is considered"]
    #[doc = "  \"slow\", in microseconds."]
    #[doc = ""]
    #[doc = "  Only relevant if the datastore_reporting.enabled field is set to true."]
    #[doc = ""]
    #[doc = "  Default: 500000, or 0.5 seconds."]
    pub threshold_us: newrelic_time_us_t,
}
#[test]
fn bindgen_test_layout__newrelic_transaction_tracer_config_t__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_newrelic_transaction_tracer_config_t__bindgen_ty_1>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(_newrelic_transaction_tracer_config_t__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_newrelic_transaction_tracer_config_t__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_newrelic_transaction_tracer_config_t__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_newrelic_transaction_tracer_config_t__bindgen_ty_1>())).enabled
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_newrelic_transaction_tracer_config_t__bindgen_ty_1),
            "::",
            stringify!(enabled)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_newrelic_transaction_tracer_config_t__bindgen_ty_1>()))
                .record_sql as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_newrelic_transaction_tracer_config_t__bindgen_ty_1),
            "::",
            stringify!(record_sql)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_newrelic_transaction_tracer_config_t__bindgen_ty_1>()))
                .threshold_us as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_newrelic_transaction_tracer_config_t__bindgen_ty_1),
            "::",
            stringify!(threshold_us)
        )
    );
}
#[test]
fn bindgen_test_layout__newrelic_transaction_tracer_config_t() {
    assert_eq!(
        ::std::mem::size_of::<_newrelic_transaction_tracer_config_t>(),
        40usize,
        concat!(
            "Size of: ",
            stringify!(_newrelic_transaction_tracer_config_t)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_newrelic_transaction_tracer_config_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_newrelic_transaction_tracer_config_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_newrelic_transaction_tracer_config_t>())).enabled as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_newrelic_transaction_tracer_config_t),
            "::",
            stringify!(enabled)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_newrelic_transaction_tracer_config_t>())).threshold as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_newrelic_transaction_tracer_config_t),
            "::",
            stringify!(threshold)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_newrelic_transaction_tracer_config_t>())).duration_us
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_newrelic_transaction_tracer_config_t),
            "::",
            stringify!(duration_us)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_newrelic_transaction_tracer_config_t>()))
                .stack_trace_threshold_us as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_newrelic_transaction_tracer_config_t),
            "::",
            stringify!(stack_trace_threshold_us)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_newrelic_transaction_tracer_config_t>())).datastore_reporting
                as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_newrelic_transaction_tracer_config_t),
            "::",
            stringify!(datastore_reporting)
        )
    );
}
pub type newrelic_transaction_tracer_config_t = _newrelic_transaction_tracer_config_t;
#[doc = " @brief Configuration used to configure how datastore segments"]
#[doc = " are recorded in a transaction."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _newrelic_datastore_segment_config_t {
    #[doc = " @brief Configuration which controls whether datastore instance"]
    #[doc = "  names are reported to New Relic."]
    #[doc = ""]
    #[doc = " If set to true for a transaction, instance names are reported to New"]
    #[doc = " Relic. More specifically, the host and port_path_or_id fields in a"]
    #[doc = "  newrelic_datastore_segment_params_t passed to"]
    #[doc = "  newrelic_datastore_start_segment() is reported when the"]
    #[doc = "  corresponding transaction is reported."]
    pub instance_reporting: bool,
    #[doc = " @brief Configuration which controls whether datastore database"]
    #[doc = "  names are reported to New Relic."]
    #[doc = ""]
    #[doc = "  If set to true for a transaction, database names are reported to New"]
    #[doc = "  Relic. More specifically, the database_name field in a"]
    #[doc = "  newrelic_datastore_segment_params_t passed to"]
    #[doc = "  newrelic_datastore_start_segment() is reported when the"]
    #[doc = "  corresponding transaction is reported."]
    pub database_name_reporting: bool,
}
#[test]
fn bindgen_test_layout__newrelic_datastore_segment_config_t() {
    assert_eq!(
        ::std::mem::size_of::<_newrelic_datastore_segment_config_t>(),
        2usize,
        concat!(
            "Size of: ",
            stringify!(_newrelic_datastore_segment_config_t)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_newrelic_datastore_segment_config_t>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(_newrelic_datastore_segment_config_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_newrelic_datastore_segment_config_t>())).instance_reporting
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_newrelic_datastore_segment_config_t),
            "::",
            stringify!(instance_reporting)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_newrelic_datastore_segment_config_t>())).database_name_reporting
                as *const _ as usize
        },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(_newrelic_datastore_segment_config_t),
            "::",
            stringify!(database_name_reporting)
        )
    );
}
pub type newrelic_datastore_segment_config_t = _newrelic_datastore_segment_config_t;
#[doc = " @brief Optional configuration for the underlying communication mechanism"]
#[doc = " between an instrumented application and the daemon. The default is to use"]
#[doc = " a UNIX-domain socket located at /tmp/.newrelic.sock. If this default works"]
#[doc = " for your system, creating this configuration is not necessary."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _newrelic_process_config_t {
    #[doc = "  @brief Specify the communication mechanism by setting daemon_socket to a"]
    #[doc = "  socket name."]
    #[doc = ""]
    #[doc = "  Domain Sockets: If you want to use UNIX domain sockets as the underlying"]
    #[doc = "  communication mechanism, the name assigned to daemon_socket"]
    #[doc = "  must begin with a \"/\", e.g., \"/domain_socket\"."]
    #[doc = ""]
    #[doc = "  TCP Socket: If you want to use a normal TCP socket, set daemon_socket"]
    #[doc = "  to an integer value in the range 1-65534.  This instructs the daemon"]
    #[doc = "  to listen on a normal TCP socket on the port specified."]
    #[doc = ""]
    #[doc = "  Abstract Socket: If you want to use an abstract socket, the name"]
    #[doc = "  assigned to daemon_socket must begin with a \"@\","]
    #[doc = "  e.g., \"@abstract_socket\"."]
    pub daemon_socket: [::std::os::raw::c_char; 512usize],
}
#[test]
fn bindgen_test_layout__newrelic_process_config_t() {
    assert_eq!(
        ::std::mem::size_of::<_newrelic_process_config_t>(),
        512usize,
        concat!("Size of: ", stringify!(_newrelic_process_config_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_newrelic_process_config_t>(),
        1usize,
        concat!("Alignment of ", stringify!(_newrelic_process_config_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_newrelic_process_config_t>())).daemon_socket as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_newrelic_process_config_t),
            "::",
            stringify!(daemon_socket)
        )
    );
}
pub type newrelic_process_config_t = _newrelic_process_config_t;
#[doc = " @brief Configuration used to describe application name, license key, as"]
#[doc = " well as optional transaction tracer and datastore configuration."]
#[doc = ""]
#[doc = " @see newrelic_create_app_config()."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _newrelic_app_config_t {
    #[doc = " @brief Specifies the name of the application to which data shall be reported."]
    pub app_name: [::std::os::raw::c_char; 255usize],
    #[doc = " @brief Specifies the New Relic license key to use."]
    pub license_key: [::std::os::raw::c_char; 255usize],
    #[doc = "  @brief Optional.  Specifies the New Relic provided host. There is little reason"]
    #[doc = "  to ever change this from the default."]
    pub redirect_collector: [::std::os::raw::c_char; 100usize],
    #[doc = "  @brief Optional. Specifies the file to be used for C SDK logs."]
    #[doc = ""]
    #[doc = "  If no filename is provided, no logging shall occur."]
    pub log_filename: [::std::os::raw::c_char; 512usize],
    #[doc = " @brief Optional. Specifies the logfile\'s level of detail."]
    #[doc = ""]
    #[doc = " There is little reason to change this from the default value except"]
    #[doc = " in troubleshooting scenarios."]
    #[doc = ""]
    #[doc = " Must be one of the following values: NEWRELIC_LOG_ERROR,"]
    #[doc = " NEWRELIC_LOG_WARNING NEWRELIC_LOG_INFO (default), NEWRELIC_LOG_DEBUG."]
    pub log_level: newrelic_loglevel_t,
    #[doc = "  @brief Optional. The transaction tracer configuration."]
    #[doc = ""]
    #[doc = "  By default, the configuration returned by newrelic_new_config()"]
    #[doc = "  will enable transaction traces, with the threshold set to"]
    #[doc = "  NEWRELIC_THRESHOLD_IS_APDEX_FAILING."]
    pub transaction_tracer: newrelic_transaction_tracer_config_t,
    #[doc = "  @brief Optional. The datastore tracer configuration."]
    #[doc = ""]
    #[doc = "  By default, the configuration returned by newrelic_new_config()"]
    #[doc = "  will enable datastore segments with instance_reporting and"]
    #[doc = "  database_name_reporting set to true."]
    pub datastore_tracer: newrelic_datastore_segment_config_t,
}
#[test]
fn bindgen_test_layout__newrelic_app_config_t() {
    assert_eq!(
        ::std::mem::size_of::<_newrelic_app_config_t>(),
        1176usize,
        concat!("Size of: ", stringify!(_newrelic_app_config_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_newrelic_app_config_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_newrelic_app_config_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_newrelic_app_config_t>())).app_name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_newrelic_app_config_t),
            "::",
            stringify!(app_name)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_newrelic_app_config_t>())).license_key as *const _ as usize
        },
        255usize,
        concat!(
            "Offset of field: ",
            stringify!(_newrelic_app_config_t),
            "::",
            stringify!(license_key)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_newrelic_app_config_t>())).redirect_collector as *const _
                as usize
        },
        510usize,
        concat!(
            "Offset of field: ",
            stringify!(_newrelic_app_config_t),
            "::",
            stringify!(redirect_collector)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_newrelic_app_config_t>())).log_filename as *const _ as usize
        },
        610usize,
        concat!(
            "Offset of field: ",
            stringify!(_newrelic_app_config_t),
            "::",
            stringify!(log_filename)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_newrelic_app_config_t>())).log_level as *const _ as usize
        },
        1124usize,
        concat!(
            "Offset of field: ",
            stringify!(_newrelic_app_config_t),
            "::",
            stringify!(log_level)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_newrelic_app_config_t>())).transaction_tracer as *const _
                as usize
        },
        1128usize,
        concat!(
            "Offset of field: ",
            stringify!(_newrelic_app_config_t),
            "::",
            stringify!(transaction_tracer)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_newrelic_app_config_t>())).datastore_tracer as *const _ as usize
        },
        1168usize,
        concat!(
            "Offset of field: ",
            stringify!(_newrelic_app_config_t),
            "::",
            stringify!(datastore_tracer)
        )
    );
}
pub type newrelic_app_config_t = _newrelic_app_config_t;
#[doc = " @brief Segment configuration used to instrument calls to databases and object"]
#[doc = " stores."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _newrelic_datastore_segment_params_t {
    #[doc = "  @brief Specifies the datastore type, e.g., \"MySQL\", to indicate that the segment"]
    #[doc = "  represents a query against a MySQL database."]
    #[doc = ""]
    #[doc = "  New Relic recommends using the predefined NEWRELIC_DATASTORE_FIREBIRD through"]
    #[doc = "  NEWRELIC_DATASTORE_SYBASE constants for this field. If this field points"]
    #[doc = "  to a string that is not one of NEWRELIC_DATASTORE_FIREBIRD through"]
    #[doc = "  NEWRELIC_DATASTORE_SYBASE, the resulting datastore segment shall be"]
    #[doc = "  instrumented as an unsupported datastore."]
    #[doc = ""]
    #[doc = "  For SQL-like datastores supported by the C SDK, when the"]
    #[doc = "  record_sql field of the newrelic_transaction_tracer_config_t is set"]
    #[doc = "  to NEWRELIC_SQL_RAW or NEWRELIC_SQL_OBFUSCATED, the query param of the"]
    #[doc = "  newrelic_datastore_segment_config_t is reported to New Relic."]
    #[doc = ""]
    #[doc = "  This field is required to be a non-empty, null-terminated string that does"]
    #[doc = "  not include any slash characters.  Empty strings are replaced with the"]
    #[doc = "  string NEWRELIC_DATASTORE_OTHER."]
    pub product: *mut ::std::os::raw::c_char,
    #[doc = "  @brief Optional. Specifies the table or collection being used or queried against."]
    #[doc = ""]
    #[doc = "  If provided, this field is required to be a null-terminated string that"]
    #[doc = "  does not include any slash characters. It is also valid to use the default"]
    #[doc = "  NULL value, in which case the default string of \"other\" will be attached"]
    #[doc = "  to the datastore segment."]
    pub collection: *mut ::std::os::raw::c_char,
    #[doc = "  @brief Optional. Specifies the operation being performed: for example, \"select\""]
    #[doc = "  for an SQL SELECT query, or \"set\" for a Memcached set operation."]
    #[doc = "  While operations may be specified with any case, New Relic suggests"]
    #[doc = "  using lowercase."]
    #[doc = ""]
    #[doc = "  If provided, this field is required to be a null-terminated string that"]
    #[doc = "  does not include any slash characters. It is also valid to use the default"]
    #[doc = "  NULL value, in which case the default string of \"other\" will be attached"]
    #[doc = "  to the datastore segment."]
    pub operation: *mut ::std::os::raw::c_char,
    #[doc = "  @brief Optional. Specifies the datahost host name."]
    #[doc = ""]
    #[doc = "  If provided, this field is required to be a null-terminated string that"]
    #[doc = "  does not include any slash characters. It is also valid to use the default"]
    #[doc = "  NULL value, in which case the default string of \"other\" will be attached"]
    #[doc = "  to the datastore segment."]
    pub host: *mut ::std::os::raw::c_char,
    #[doc = "  @brief Optional. Specifies the port or socket used to connect to the"]
    #[doc = "  datastore."]
    #[doc = ""]
    #[doc = "  If provided, this field is required to be a null-terminated string."]
    pub port_path_or_id: *mut ::std::os::raw::c_char,
    #[doc = "  @brief Optional. Specifies the database name or number in use."]
    #[doc = ""]
    #[doc = "  If provided, this field is required to be a null-terminated string."]
    pub database_name: *mut ::std::os::raw::c_char,
    #[doc = "  @brief Optional. Specifies the database query that was sent to the server."]
    #[doc = ""]
    #[doc = "  For security reasons, this value is only used if you set product to"]
    #[doc = "  a supported sql-like datastore, NEWRELIC_DATASTORE_FIREBIRD,"]
    #[doc = "  NEWRELIC_DATASTORE_INFORMIX, NEWRELIC_DATASTORE_MSSQL, etc. This"]
    #[doc = "  allows the SDK to correctly obfuscate the query. When the product"]
    #[doc = "  is set otherwise, no query information is reported to New Relic."]
    #[doc = ""]
    #[doc = "  If provided, this field is required to be a null-terminated string."]
    pub query: *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout__newrelic_datastore_segment_params_t() {
    assert_eq!(
        ::std::mem::size_of::<_newrelic_datastore_segment_params_t>(),
        56usize,
        concat!(
            "Size of: ",
            stringify!(_newrelic_datastore_segment_params_t)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_newrelic_datastore_segment_params_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_newrelic_datastore_segment_params_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_newrelic_datastore_segment_params_t>())).product as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_newrelic_datastore_segment_params_t),
            "::",
            stringify!(product)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_newrelic_datastore_segment_params_t>())).collection as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_newrelic_datastore_segment_params_t),
            "::",
            stringify!(collection)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_newrelic_datastore_segment_params_t>())).operation as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_newrelic_datastore_segment_params_t),
            "::",
            stringify!(operation)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_newrelic_datastore_segment_params_t>())).host as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_newrelic_datastore_segment_params_t),
            "::",
            stringify!(host)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_newrelic_datastore_segment_params_t>())).port_path_or_id
                as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_newrelic_datastore_segment_params_t),
            "::",
            stringify!(port_path_or_id)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_newrelic_datastore_segment_params_t>())).database_name
                as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_newrelic_datastore_segment_params_t),
            "::",
            stringify!(database_name)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_newrelic_datastore_segment_params_t>())).query as *const _
                as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_newrelic_datastore_segment_params_t),
            "::",
            stringify!(query)
        )
    );
}
pub type newrelic_datastore_segment_params_t = _newrelic_datastore_segment_params_t;
#[doc = " @brief Segment configuration used to instrument external calls."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _newrelic_external_segment_params_t {
    #[doc = " @brief The URI that was loaded. This field is required to be a null-terminated"]
    #[doc = " string containing a valid URI, and cannot be NULL."]
    pub uri: *mut ::std::os::raw::c_char,
    #[doc = " @brief The procedure used to load the external resource."]
    #[doc = ""]
    #[doc = " In HTTP contexts, this will usually be the request method (eg `GET`,"]
    #[doc = " `POST`, et al). For non-HTTP requests, or protocols that encode more"]
    #[doc = " specific semantics on top of HTTP like SOAP, you may wish to use a"]
    #[doc = " different value that more precisely encodes how the resource was"]
    #[doc = " requested."]
    #[doc = ""]
    #[doc = " If provided, this field is required to be a null-terminated string that"]
    #[doc = " does not include any slash characters. It is also valid to provide NULL,"]
    #[doc = " in which case no procedure will be attached to the external segment."]
    pub procedure: *mut ::std::os::raw::c_char,
    #[doc = " @brief The library used to load the external resource."]
    #[doc = ""]
    #[doc = " If provided, this field is required to be a null-terminated string that"]
    #[doc = " does not include any slash characters. It is also valid to provide NULL,"]
    #[doc = " in which case no library will be attached to the external segment."]
    pub library: *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout__newrelic_external_segment_params_t() {
    assert_eq!(
        ::std::mem::size_of::<_newrelic_external_segment_params_t>(),
        24usize,
        concat!("Size of: ", stringify!(_newrelic_external_segment_params_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_newrelic_external_segment_params_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_newrelic_external_segment_params_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_newrelic_external_segment_params_t>())).uri as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_newrelic_external_segment_params_t),
            "::",
            stringify!(uri)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_newrelic_external_segment_params_t>())).procedure as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_newrelic_external_segment_params_t),
            "::",
            stringify!(procedure)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_newrelic_external_segment_params_t>())).library as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_newrelic_external_segment_params_t),
            "::",
            stringify!(library)
        )
    );
}
pub type newrelic_external_segment_params_t = _newrelic_external_segment_params_t;
extern "C" {
    #[doc = " @brief Configure the C SDK\'s logging system."]
    #[doc = ""]
    #[doc = " If the logging system was previously initialized (either by a prior call to"]
    #[doc = " newrelic_configure_log() or implicitly by a call to newrelic_init() or"]
    #[doc = " newrelic_create_app()), then invoking this function will close the previous"]
    #[doc = " log file."]
    #[doc = ""]
    #[doc = " @param [in] filename The path to the file to write logs to. If this is the"]
    #[doc = " literal string \"stdout\" or \"stderr\", then logs will be written to standard"]
    #[doc = " output or standard error, respectively."]
    #[doc = " @param [in] level The lowest level of log message that will be output."]
